update best practice
